class Program_Major_Detail {
  late final String title;
  late final String description;

  Program_Major_Detail({required this.title, required this.description});
}

List<Program_Major_Detail> program_major_detail = [
  Program_Major_Detail(
      title: 'ក. ចំណេះដឹង',
      description:
          'PLO1. បកស្រាយពីទំនាក់ទំនងនៃប្រវត្តិសាស្រ្ត វប្បធម៌ ប្រព័ន្ធនយោបាយ និងសេដ្ឋកិច្ចនៅក្នុងបណ្តា ប្រទេសអាស៊ីអាគ្នេយ៍បានយ៉ាងច្បាស់លាស់'
          'PLO2. ប្រើប្រាស់ភាសាអង់គ្លេស និងបច្ចេកវិទ្យាព័ត៌មាន វិទ្យាសម្រាប់ការសិក្សាស្រាវជ្រាវនិងការងាររដ្ឋបាលនៅតាមបណ្តាស្ថាប័នរដ្ឋ ឯកជន និងអង្គការមិនមែនរដ្ឋាភិបាល'
          'PLO3. បផ្សារភ្ជាប់ទ្រឹស្តីទៅនឹងការអនុវត្តជាក់ស្តែងតាមបណ្តាស្ថាប័នរដ្ឋ ឯកជន និងអង្គការមិនមែន រដ្ឋាភិបាល ។'
  ),
  Program_Major_Detail(
      title: 'ខ. ជំនាញក្នុងការគិត',
      description:
          'PLO1. បកស្រាយពីទំនាក់ទំនងនៃប្រវត្តិសាស្រ្ត វប្បធម៌ ប្រព័ន្ធនយោបាយ និងសេដ្ឋកិច្ចនៅក្នុងបណ្តា ប្រទេសអាស៊ីអាគ្នេយ៍បានយ៉ាងច្បាស់លាស់'
          'PLO2. ប្រើប្រាស់ភាសាអង់គ្លេស និងបច្ចេកវិទ្យាព័ត៌មាន វិទ្យាសម្រាប់ការសិក្សាស្រាវជ្រាវនិងការងាររដ្ឋបាលនៅតាមបណ្តាស្ថាប័នរដ្ឋ ឯកជន និងអង្គការមិនមែនរដ្ឋាភិបាល'
          'PLO3. បផ្សារភ្ជាប់ទ្រឹស្តីទៅនឹងការអនុវត្តជាក់ស្តែងតាមបណ្តាស្ថាប័នរដ្ឋ ឯកជន និងអង្គការមិនមែន រដ្ឋាភិបាល ។'
  ),
  Program_Major_Detail(
      title: 'គ. ជំនាញទំនាក់ទំនងអន្តរបុគ្គល និងការទទួលខុសត្រូវ',
      description:
      'PLO1. បកស្រាយពីទំនាក់ទំនងនៃប្រវត្តិសាស្រ្ត វប្បធម៌ ប្រព័ន្ធនយោបាយ និងសេដ្ឋកិច្ចនៅក្នុងបណ្តា ប្រទេសអាស៊ីអាគ្នេយ៍បានយ៉ាងច្បាស់លាស់'
          'PLO2. ប្រើប្រាស់ភាសាអង់គ្លេស និងបច្ចេកវិទ្យាព័ត៌មាន វិទ្យាសម្រាប់ការសិក្សាស្រាវជ្រាវនិងការងាររដ្ឋបាលនៅតាមបណ្តាស្ថាប័នរដ្ឋ ឯកជន និងអង្គការមិនមែនរដ្ឋាភិបាល'
          'PLO3. បផ្សារភ្ជាប់ទ្រឹស្តីទៅនឹងការអនុវត្តជាក់ស្តែងតាមបណ្តាស្ថាប័នរដ្ឋ ឯកជន និងអង្គការមិនមែន រដ្ឋាភិបាល ។'
  ),
  Program_Major_Detail(
      title: 'ឃ. ជំនាញលេខនព្វន្ត ព័ត៌មានវិទ្យា និងទំនាក់ទំនង',
      description:
      'PLO1. បកស្រាយពីទំនាក់ទំនងនៃប្រវត្តិសាស្រ្ត វប្បធម៌ ប្រព័ន្ធនយោបាយ និងសេដ្ឋកិច្ចនៅក្នុងបណ្តា ប្រទេសអាស៊ីអាគ្នេយ៍បានយ៉ាងច្បាស់លាស់'
          'PLO2. ប្រើប្រាស់ភាសាអង់គ្លេស និងបច្ចេកវិទ្យាព័ត៌មាន វិទ្យាសម្រាប់ការសិក្សាស្រាវជ្រាវនិងការងាររដ្ឋបាលនៅតាមបណ្តាស្ថាប័នរដ្ឋ ឯកជន និងអង្គការមិនមែនរដ្ឋាភិបាល'
          'PLO3. បផ្សារភ្ជាប់ទ្រឹស្តីទៅនឹងការអនុវត្តជាក់ស្តែងតាមបណ្តាស្ថាប័នរដ្ឋ ឯកជន និងអង្គការមិនមែន រដ្ឋាភិបាល ។'
  ),
];
