class FAQ {
  late final String question;
  late final String answer;

  FAQ({required this.question, required this.answer});
}

List<FAQ> faq = [
  FAQ(
      question:
          '1. ដើម្បីដាក់ពាក្យចូលរៀន តើនិស្សិតត្រូវភ្ជាប់ជាមួយឯកសារអ្វីខ្លះ?',
      answer: 'លក្ខខណ្ឌក្នុងការចុះឈ្មោះចូលរៀនក្នុងថ្នាក់អនុបណ្ឌិតនៅ USEA'
          '-​ សញ្ញាបត្របញ្ជាក់ធ្លាក់ឬជាប់បាកឌុប ២សន្លឹក'
          '-​ រូបថត ៣ x ៤ ៤សន្លឹក'
          '-​ រូបថត ៤ x ៦ ៣សន្លឹក'),
  FAQ(
      question:
      '2. តើថ្នាក់បរិញ្ញាបត្រត្រូវរៀនប៉ុន្មានឆ្នាំ?',
      answer: 'សាកលវិទ្យាល័យសៅស៍អ៊ីសថ៍អេយសៀមានទីតាំងស្ថិតនៅទល់មុខវិទ្យាល័យអង្គរ ក្រុងសៀមរៀប ខេត្តសៀមរាប ។'),
  FAQ(
      question:
      '3. តើសាលាមានទីតាំងនៅឯណា?',
      answer: 'សាកលវិទ្យាល័យសៅស៍អ៊ីសថ៍អេយសៀមានទីតាំងស្ថិតនៅទល់មុខវិទ្យាល័យអង្គរ ក្រុងសៀមរៀប ខេត្តសៀមរាប ។'),
];
