import 'package:flutter/material.dart';


class Registration {
  late final String title;
  late final String date;
  late final String time;
  late final String bachelor1;
  late final String bachelor2;
  late final String detail1;
  late final String detail2;
  late final String detail3;

  Registration(
      {required this.title,
        required this.date,
        required this.time,
        required this.bachelor1,
        required this.bachelor2,
        required this.detail1,
        required this.detail2,
        required this.detail3});
}

List<Registration> registration = [
  Registration(
      title: 'កាលបរិច្ឆេទចូលរៀន និងម៉ោងសិក្សាសម្រាប់កម្មវិធី សិក្សាថ្ងៃច័ន្ទ ដល់ថ្ងៃសៅរិ៍',
      date: 'កាលបរិច្ឆេទចូលរៀនសម្រាប់ថ្នាក់បរិញ្ញាបត្ររង​ និងបរិញ្ញាបត្រដូចខាងក្រោម៖',
      time: 'ម៉ោងសិក្សាសម្រាប់ថ្នាក់បរិញ្ញាបត្ររង​ និងបរិញ្ញាបត្រដូចខាងក្រោម៖',
      bachelor1: 'ថ្នាក់បរិញ្ញាបត្ររង',
      bachelor2: 'ថ្នាក់បរិញ្ញាបត្រ',
      detail1: '_ វគ្គសិក្សាទី១ ចូលរៀនថ្ងៃទី ១៦​ ខែ មករា ឆ្នាំ ២០២៣'
               '​_ វគ្គសិក្សាទី២ ចូលរៀនថ្ងៃទី ១៣​ ខែ កុម្ភៈ ឆ្នាំ ២០២៣'
               '​_ វគ្គសិក្សាទី៣ ចូលរៀនថ្ងៃទី ២០​ ខែ មីនា ឆ្នាំ ២០២៣',
      detail2: '_ វគ្គសិក្សាទី១ ចូលរៀនថ្ងៃទី ១៦​ ខែ មករា ឆ្នាំ ២០២៥'
               '​_ វគ្គសិក្សាទី២ ចូលរៀនថ្ងៃទី ១៣​ ខែ កុម្ភៈ ឆ្នាំ ២០២៣',
      detail3: '_ ពេលព្រឹក៖ ម៉ោង ៧ៈ០០ ដល់ ១០ៈ១៥\t\t\t\t\t\t\t\t'
               '​_ ពេលរសៀល៖ ម៉ោង ១៤ៈ០០ ដល់ ១៧ៈ១៥'
               '​_ពេលល្ងាច៖ ម៉ោង ១៨ៈ០០ ដល់ ២១ៈ១៥'),
  Registration(
      title: 'កាលបរិច្ឆេទចូលរៀន និងម៉ោងសិក្សាសម្រាប់កម្មវិធី សិក្សាថ្ងៃសៅរិ៍ ដល់ថ្ងៃអាទិត្យ',
      date: 'កាលបរិច្ឆេទចូលរៀនសម្រាប់ថ្នាក់បរិញ្ញាបត្ររង​ និងបរិញ្ញាបត្រដូចខាងក្រោម៖',
      time: 'ម៉ោងសិក្សាសម្រាប់ថ្នាក់បរិញ្ញាបត្ររង​ និងបរិញ្ញាបត្រដូចខាងក្រោម៖',
      bachelor1: 'ថ្នាក់បរិញ្ញាបត្ររង',
      bachelor2: 'ថ្នាក់បរិញ្ញាបត្រ',
      detail1: '_ វគ្គសិក្សាទី១ ចូលរៀនថ្ងៃទី ១៦​ ខែ មករា ឆ្នាំ ២០២៣'
               '​_ វគ្គសិក្សាទី២ ចូលរៀនថ្ងៃទី ១៣​ ខែ កុម្ភៈ ឆ្នាំ ២០២៣'
               '​_ វគ្គសិក្សាទី៣ ចូលរៀនថ្ងៃទី ២០​ ខែ មីនា ឆ្នាំ ២០២៣',
      detail2: '_ វគ្គសិក្សាទី១ ចូលរៀនថ្ងៃទី ១៦​ ខែ មករា ឆ្នាំ ២០២៣'
               '​_ វគ្គសិក្សាទី២ ចូលរៀនថ្ងៃទី ១៣​ ខែ កុម្ភៈ ឆ្នាំ ២០២៣',
      detail3: '_ ពេលព្រឹក៖ ម៉ោង ៧ៈ០០ ដល់ ១០ៈ១៥\t\t\t\t\t\t\t\t'
               '​_ ពេលរសៀល៖ ម៉ោង ១៤ៈ០០ ដល់ ១៧ៈ១៥'
               '​_ ពេលល្ងាច៖ ម៉ោង ១៨ៈ០០ ដល់ ២១ៈ១៥'),
];