import 'package:flutter/material.dart';

class Up_News_Event {
  late final String img;
  late final String title;
  late final String icon1;
  late final String txt_date;
  late final String icon2;
  late final String txt_time;
  late final String description;
  late final String detail_description;

  Up_News_Event(
      {required this.img,
        required this.title,
        required this.icon1,
        required this.txt_date,
        required this.icon2,
        required this.txt_time,
        required this.description,
        required this.detail_description
      });
}


List<Up_News_Event> up_news_event = [
  Up_News_Event(
      img: 'assets/image/9.jpg',
      title: 'ពិធីប្រគល់សញ្ញាបត្រដល់និស្សិតព័ត៌មានវិទ្យា ជំនាន់ទី១៣-១៤',
      icon1: 'assets/image/Event_Date.png',
      txt_date: 'ថ្ងៃច័ន្ទ ទី១៣ ខែកមីនា ឆ្នាំ២០២៣',
      icon2: 'assets/image/Event_Time.png',
      txt_time: '៨ៈ០០ ព្រឹក',
      description: 'របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។',
      detail_description: 'របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។ របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។ របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។',

  ),
  Up_News_Event(
      img: 'assets/image/1.jpg',
      title: 'ពិធីប្រគល់សញ្ញាបត្រដល់និស្សិតព័ត៌មានវិទ្យា ជំនាន់ទី១៦-១៨',
      icon1: 'assets/image/Event_Date.png',
      txt_date: 'ថ្ងៃច័ន្ទ ទី១៧ ខែកមីនា ឆ្នាំ២០២៤',
      icon2: 'assets/image/Event_Time.png',
      txt_time: '៨ៈ០០ ព្រឹក',
      description: 'របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។',
      detail_description: 'របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។ របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។ របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។',

  ),
  Up_News_Event(
      img: 'assets/image/2.jpg',
      title: 'ពិធីប្រគល់សញ្ញាបត្រដល់និស្សិតព័ត៌មានវិទ្យា ជំនាន់ទី១៦-១៨',
      icon1: 'assets/image/Event_Date.png',
      txt_date: 'ថ្ងៃច័ន្ទ ទី១៧ ខែកមីនា ឆ្នាំ២០២៤',
      icon2: 'assets/image/Event_Time.png',
      txt_time: '៨ៈ០០ ព្រឹក',
      description: 'របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។',
      detail_description: 'របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។ របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។ របស់​ឯកឧត្តម​ ឧបនាយករដ្ឋមន្ត្រី​ កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២្ររងចំនួន២០កន្លែង កែ​ គឹមយ៉ាន​ នៅ​សកល​វិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ ឆ្នាំសិក្សា ២០២១-២០២២​នួន២០កន្លែង។',

  ),
];