import 'package:get/get.dart';

class LocaleString extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'km_KH': {
          // Guest Dashboard
          'ព្រឹត្តិការណ៍': 'ព្រឹត្តិការណ៍',
          'ការចុះឈ្មោះ': 'ការចុះឈ្មោះ',
          'កម្មវិធីសិក្សា': 'កម្មវិធីសិក្សា',
          'អាហារូបករណ៍': 'អាហារូបករណ៍',
          'ព័ត៌មានការងារ': 'ព័ត៌មានការងារ',
          'វីដេអូ': 'វីដេអូ',
          'ទំនាក់ទំនង': 'ទំនាក់ទំនង',
          'អំពីយើង': 'អំពីយើង',
          'ផ្លាស់ប្ដូរភាសា': 'ផ្លាស់ប្ដូរភាសា',
          'FAQ': 'FAQ',
          'ទំព័រដើម': 'ទំព័រដើម',
          'ចូលគណនី': 'ចូលគណនី',

          // News Event
          'ព្រឹត្តិការណ៍នាពេលខាងមុខ': 'ព្រឹត្តិការណ៍នាពេលខាងមុខ',
          'ព្រឹត្តិការណ៍មុនៗ': 'ព្រឹត្តិការណ៍មុនៗ',

          // Program
          'មហាវិទ្យាល័យសេដ្ឋកិច្ច ពាណិជ្ជកម្ម និងទេសចរណ៍':
              'មហាវិទ្យាល័យសេដ្ឋកិច្ច ពាណិជ្ជកម្ម និងទេសចរណ៍',
          'មហាវិទ្យាល័យវិទ្យាសាស្ត្រ និងបច្ចេកវិទ្យា':
              'មហាវិទ្យាល័យវិទ្យាសាស្ត្រ និងបច្ចេកវិទ្យា',
          'មហាវិទ្យាល័យវិទ្យាសាស្ត្រសង្គម និងនីតិសាស្ត្រ':
              'មហាវិទ្យាល័យវិទ្យាសាស្ត្រសង្គម និងនីតិសាស្ត្រ',
          'មហាវិទ្យាល័យសិល្បៈ មនុស្សសាស្ត្រ និងអប់រំ':
              'មហាវិទ្យាល័យសិល្បៈ មនុស្សសាស្ត្រ និងអប់រំ',
          'មហាវិទ្យាល័យអន្តរជាតិ': 'មហាវិទ្យាល័យអន្តរជាតិ',
          'វិទ្យាស្ថានភាសាបរទេស': 'វិទ្យាស្ថានភាសាបរទេស',
          'សាលាថ្នាក់ក្រោយបរិញ្ញាបត្រ': 'សាលាថ្នាក់ក្រោយបរិញ្ញាបត្រ',
          'ម៉ាឃីតធីង': 'ម៉ាឃីតធីង',
          'គ្រប់គ្រង': 'គ្រប់គ្រង',
          'ស្ថាបត្យកម្ម': 'ស្ថាបត្យកម្ម',
          'ព័ត៌មានវិទ្យា': 'ព័ត៌មានវិទ្យា',
          'វិស្វកម្មសំណង់សុីវិល': 'វិស្វកម្មសំណង់សុីវិល',
          'នីតិសាស្ត្រ': 'នីតិសាស្ត្រ',
          'រដ្ឋបាលសាធារណៈ': 'រដ្ឋបាលសាធារណៈ',
          'អក្សរសាស្ត្រខ្មែរ': 'អក្សរសាស្ត្រខ្មែរ',
          'ប្រវិត្តវិទ្យា': 'ប្រវិត្តវិទ្យា',
          'បង្រៀនភាសាអង់គ្លេស': 'បង្រៀនភាសាអង់គ្លេស',
          'បកប្រែភាសាអង់គ្លេស': 'បកប្រែភាសាអង់គ្លេស',
          'ថ្នាក់បរិញ្ញាបត្រជាន់ខ្ពស់': 'ថ្នាក់បរិញ្ញាបត្រជាន់ខ្ពស់',
          'ថ្នាក់បណ្ឌិត': 'ថ្នាក់បណ្ឌិត',
          '\t\tស្វែងរក': '\t\tស្វែងរក',
          'ថ្នាក់បរិញ្ញាបត្ររង': 'ថ្នាក់បរិញ្ញាបត្ររង',
          'ថ្នាក់បរិញ្ញាបត្រ': 'ថ្នាក់បរិញ្ញាបត្រ',
          'ឆ្នាំទី១': 'ឆ្នាំទី១',
          'ឆ្នាំទី២': 'ឆ្នាំទី២',
          'ឆ្នាំទី៣': 'ឆ្នាំទី៣',
          'ឆ្នាំទី៤': 'ឆ្នាំទី៤',
          'ឆមាសទី១': 'ឆមាសទី១',
          'ឆមាសទី២': 'ឆមាសទី២',
          'ឆមាសទី 1': 'ឆមាសទី 1',
          'ឆមាសទី 2': 'ឆមាសទី 2',
          'មុខវិជ្ជា': 'មុខវិជ្ជា',
          'ម៉ោង': 'ម៉ោង',
          'ក្រេឌីត': 'ក្រេឌីត',
          'សរុប': 'សរុប',

          // Scholarship
          'ក្នុងសាកលវិទ្យាល័យ': 'ក្នុងសាកលវិទ្យាល័យ',
          'ក្រៅសាកលវិទ្យាល័យ': 'ក្រៅសាកលវិទ្យាល័យ',
          'អានបន្ថែម': 'អានបន្ថែម',

          // Contact
          'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ':
              'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ',
          'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។':
              'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។',

          // About US
          'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា':
              'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា',
          'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ': 'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ',
          'សាររបស់សាកលវិទ្យាធិការ': 'សាររបស់សាកលវិទ្យាធិការ',
          'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ': 'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ',
          'ការទទួលស្គាល់': 'ការទទួលស្គាល់',

          // Change Language
          'ភាសា': 'ភាសា',
          'សូមជ្រើសរើសភាសា': 'សូមជ្រើសរើសភាសា',
          'ភាសាខ្មែរ': 'ភាសាខ្មែរ',
          'ភាសាអង់គ្លេស': 'ភាសាអង់គ្លេស',

          // Notification
          'ព័ត៌មានថ្មីៗ': 'ព័ត៌មានថ្មីៗ',

          // Account
          'គណនីនិស្សិត': 'គណនីនិស្សិត',
          'គណនីអាណាព្យាបាល': 'គណនីអាណាព្យាបាល',
          'គណនីបុគ្គលិក': 'គណនីបុគ្គលិក',
          'គណនីសាស្ត្រាចារ្យ': 'គណនីសាស្ត្រាចារ្យ',

          // Student Dashboard

          'ព័ត៌មានលម្អិតរបស់និស្សិត': 'ព័ត៌មានលម្អិតរបស់និស្សិត',
          'កាលវិភាគ': 'កាលវិភាគ',
          'ដំណើរការសិក្សា': 'ដំណើរការសិក្សា',
          'វត្តមាន': 'វត្តមាន',
          'ការបង់ប្រាក់': 'ការបង់ប្រាក់',
          'ប្រវត្តិការងារ': 'ប្រវត្តិការងារ',
          'ព័ត៌មានការសិក្សា': 'ព័ត៌មានការសិក្សា',
          'មតិកែលម្អ': 'មតិកែលម្អ',
          'សមិទ្ធិផល': 'សមិទ្ធិផល',

          // Student Login
          'គណនីនិសិ្សត': 'គណនីនិសិ្សត',
          'អត្តលេខនិស្សិត': 'អត្តលេខនិស្សិត',
          '\t\tបញ្ចូលអត្តលេខ': '\t\tបញ្ចូលអត្តលេខ',
          'សូមបញ្ចូលអត្តលេខ': 'សូមបញ្ចូលអត្តលេខ',
          'ពាក្យសម្ងាត់': 'ពាក្យសម្ងាត់',
          '\t\tបញ្ចូលពាក្យសម្ងាត់': '\t\tបញ្ចូលពាក្យសម្ងាត់',
          'សូមបញ្ចូលពាក្យសម្ងាត់': 'សូមបញ្ចូលពាក្យសម្ងាត់',
          'ចូល': 'ចូល',
          'អត្តលេខនិស្សិត ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!':
              'អត្តលេខនិស្សិត ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!',

          // Student Detail
          'ឆ្នាំ': 'ឆ្នាំ',
          'ឆមាស': 'ឆមាស',
          'ជំនាន់': 'ជំនាន់',
          'វគ្គ': 'វគ្គ',
          'ឆ្នាំមូលដ្ឋាន': 'ឆ្នាំមូលដ្ឋាន',
          'មហាវិទ្យាល័យ': 'មហាវិទ្យាល័យ',
          'កម្រិតសិក្សា': 'កម្រិតសិក្សា',
          'មុខជំនាញ': 'មុខជំនាញ',
          'បន្ទប់សិក្សា': 'បន្ទប់សិក្សា',
          'វេនសិក្សា': 'វេនសិក្សា',
          'ស្ថានភាពសិក្សា': 'ស្ថានភាពសិក្សា',
          'ថ្ងៃកំណើត': 'ថ្ងៃកំណើត',
          'លេខទូរស័ព្ទ': 'លេខទូរស័ព្ទ',
          'មុខតំណែង': 'មុខតំណែង',
          'ស្ថាប័ន': 'ស្ថាប័ន',

          // Student Log out
          'ចាកចេញ': 'ចាកចេញ',
          'តើអ្នកប្រាកដថាអ្នកនឹងចាកចេញពីគណនីនិសិ្សតដែរឬទេ?':
              'តើអ្នកប្រាកដថាអ្នកនឹងចាកចេញពីគណនីនិសិ្សតដែរឬទេ?',
          'បោះបង់': 'បោះបង់',

          // Student Survey
          'សូមជួយវាយដម្លៃការបង្រៀនរបស់សាស្ត្រាចារ្យ':
              'សូមជួយវាយដម្លៃការបង្រៀនរបស់សាស្ត្រាចារ្យ',
          '\tចំនួនក្រឌីតសរុប': '\tចំនួនក្រឌីតសរុប',
          '\tចំនួនក្រឌីតបានបំពេញ': '\tចំនួនក្រឌីតបានបំពេញ',
          'សូមជួយធ្វើការវាយតម្លៃ': 'សូមជួយធ្វើការវាយតម្លៃ',
          'ការវាយតម្លៃ': 'ការវាយតម្លៃ',
          'សូមជ្រើសរើសប្រភេទនៃការវាយតម្លៃ!!!':
              'សូមជ្រើសរើសប្រភេទនៃការវាយតម្លៃ!!!',
          'ការវាយតម្លៃទី 1': 'ការវាយតម្លៃទី 1',
          'ការវាយតម្លៃទី 2': 'ការវាយតម្លៃទី 2',

          // Student Schedule
          'កាលវិភាគសិក្សា': 'កាលវិភាគសិក្សា',

          // Student Perfomance
          'មធ្យមភាគៈ': 'មធ្យមភាគៈ',
          'ចំណាត់ថ្នាក់ប្រចាំថ្នាក់ៈ': 'ចំណាត់ថ្នាក់ប្រចាំថ្នាក់ៈ',
          'ពិន្ទុ': 'ពិន្ទុ',
          'លំហាត់': 'លំហាត់',
          'កិច្ចការផ្ទះ': 'កិច្ចការផ្ទះ',
          'កិច្ចការក្រុម': 'កិច្ចការក្រុម',
          'ពាក់កណ្ដាលឆមាស': 'ពាក់កណ្ដាលឆមាស',

          // Student Attendance
          'វត្តមាន\t': 'វត្តមាន\t',
          'យឺត': 'យឺត',
          'អវត្តមានមានច្បាប់': 'អវត្តមានមានច្បាប់',
          'អវត្តមាន': 'អវត្តមាន',
          '\tក្រេឌីត\t': '\tក្រេឌីត\t',
          '\tម៉ោង': '\tម៉ោង',
          'មើលទាំងអស់': 'មើលទាំងអស់',
          'ឆ្នាំទី​ ១': 'ឆ្នាំទី​ ១',
          'ឆ្នាំទី​ ២': 'ឆ្នាំទី​ ២',
          'ឆ្នាំទី​ ៣': 'ឆ្នាំទី​ ៣',
          'ឆ្នាំទី​ ៤': 'ឆ្នាំទី​ ៤',
          'ឆមាសទី ១': 'ឆមាសទី ១',
          'ឆមាសទី ២': 'ឆមាសទី ២',
          'Year I': 'ឆ្នាំទី​ ១',
          'Year II': 'ឆ្នាំទី​ ២',
          'Year III': 'ឆ្នាំទី​ ៣',
          'Year IV': 'ឆ្នាំទី​ ៤',
          'Semester I': 'ឆមាសទី ១',
          'Semester II': 'ឆមាសទី ២',
          'កាលបរិច្ឆេទ': 'កាលបរិច្ឆេទ',

          // Student Payment
          'ឆ្នាំទី​ ': 'ឆ្នាំទី​ ',
          'ការបង់ថ្លៃឈ្នួលសិក្សា': 'ការបង់ថ្លៃឈ្នួលសិក្សា',
          'ការបង់ថ្លៃឈ្នួលប្រឡងឡើងវិញ': 'ការបង់ថ្លៃឈ្នួលប្រឡងឡើងវិញ',
          'ការបង់ថ្លៃឈ្នួលរៀនបំពេញក្រេឌីត': 'ការបង់ថ្លៃឈ្នួលរៀនបំពេញក្រេឌីត',
          'ការបង់ថ្លៃឈ្នួលដកលិខិតបញ្ជាក់ការសិក្សាផ្សេងៗ':
              'ការបង់ថ្លៃឈ្នួលដកលិខិតបញ្ជាក់ការសិក្សាផ្សេងៗ',
          'ទឹកប្រាក់ត្រូវបង់': 'ទឹកប្រាក់ត្រូវបង់',
          'ទឹកប្រាក់បានបង់': 'ទឹកប្រាក់បានបង់',
          'ទឹកប្រាក់នៅសល់': 'ទឹកប្រាក់នៅសល់',
          'លេខវិក័យបត្រ': 'លេខវិក័យបត្រ',

          // Student Job History
          'កាលបរិច្ឆេទចូលបម្រើការងារ​\t\t\t\t\t':
              'កាលបរិច្ឆេទចូលបម្រើការងារ​\t\t\t\t\t',
          'ស្ថានភាពការងារ': 'ស្ថានភាពការងារ',
          'ប្រាក់បៀវត្ស': 'ប្រាក់បៀវត្ស',

          // Student Study Info
          'មុខវិជ្ជា\t': 'មុខវិជ្ជា\t',
          'បន្ទប់\t': 'បន្ទប់\t',
          'ម៉ោង\t': 'ម៉ោង\t',
          'លេខតុ\t': 'លេខតុ\t',

          // Student Feedback
          'សូមអធ្យាស្រ័យ': 'សូមអធ្យាស្រ័យ',
          'សូមអធ្យាស្រ័យលោកអ្នកមិនទាន់អាចធ្វើការ Feedback បាននៅឡើយទេ!!!':
              'សូមអធ្យាស្រ័យលោកអ្នកមិនទាន់អាចធ្វើការ Feedback បាននៅឡើយទេ!!!',
        },
        'en_US': {
          // Guest Dashboard
          'ព្រឹត្តិការណ៍': 'Events',
          'ការចុះឈ្មោះ': 'Registration',
          'កម្មវិធីសិក្សា': 'Program',
          'អាហារូបករណ៍': 'Scholarship',
          'ព័ត៌មានការងារ': 'Career',
          'វីដេអូ': 'Video',
          'ទំនាក់ទំនង': 'Contact',
          'អំពីយើង': 'About US',
          'ផ្លាស់ប្ដូរភាសា': 'Change Language',
          'FAQ': 'FAQ',
          'ទំព័រដើម': 'Home',
          'ចូលគណនី': 'Account',

          // News Event
          'ព្រឹត្តិការណ៍នាពេលខាងមុខ': 'Upcoming Events',
          'ព្រឹត្តិការណ៍មុនៗ': 'Past Events',

          // Program
          'មហាវិទ្យាល័យសេដ្ឋកិច្ច ពាណិជ្ជកម្ម និងទេសចរណ៍':
              'Faculty of Economics, Business and Tourisms',
          'មហាវិទ្យាល័យវិទ្យាសាស្ត្រ និងបច្ចេកវិទ្យា':
              'Faculty of Science and Technology',
          'មហាវិទ្យាល័យវិទ្យាសាស្ត្រសង្គម និងនីតិសាស្ត្រ':
              'Faculty of Social Science and Law',
          'មហាវិទ្យាល័យសិល្បៈ មនុស្សសាស្ត្រ និងអប់រំ':
              'Faculty of Arts, Humanities and Education',
          'មហាវិទ្យាល័យអន្តរជាតិ': 'International College',
          'វិទ្យាស្ថានភាសាបរទេស': 'Foreign Language Institute',
          'សាលាថ្នាក់ក្រោយបរិញ្ញាបត្រ': 'Post Graduate',
          'ម៉ាឃីតធីង': 'Marketing',
          'គ្រប់គ្រង': 'Management',
          'ស្ថាបត្យកម្ម': 'Engineer',
          'ព័ត៌មានវិទ្យា': 'Information Technology',
          'វិស្វកម្មសំណង់សុីវិល': 'Civil Engineering',
          'នីតិសាស្ត្រ': 'Jurisprudence',
          'រដ្ឋបាលសាធារណៈ': 'Public Administration',
          'អក្សរសាស្ត្រខ្មែរ': 'Khmer Literature',
          'ប្រវិត្តវិទ្យា': 'History',
          'បង្រៀនភាសាអង់គ្លេស': 'Teaching English Language',
          'បកប្រែភាសាអង់គ្លេស': 'Translating English Language',
          'ថ្នាក់បរិញ្ញាបត្រជាន់ខ្ពស់': 'Master Degree',
          'ថ្នាក់បណ្ឌិត': 'Doctoral Degree',
          '\t\tស្វែងរក': '\t\tSearch',
          'ថ្នាក់បរិញ្ញាបត្ររង': 'Associate Degree',
          'ថ្នាក់បរិញ្ញាបត្រ': 'Bachelor Degree',
          'ឆ្នាំទី១': 'Year 1',
          'ឆ្នាំទី២': 'Year 2',
          'ឆ្នាំទី៣': 'Year 3',
          'ឆ្នាំទី៤': 'Year 4',
          'ឆមាសទី១': 'Semester I',
          'ឆមាសទី២': 'Semester II',
          'មុខវិជ្ជា': 'Subject',
          'ម៉ោង': 'Hours',
          'ក្រេឌីត': 'Credits',
          'សរុប': 'Total',

          // Scholarship
          'ក្នុងសាកលវិទ្យាល័យ': 'Inside University',
          'ក្រៅសាកលវិទ្យាល័យ': 'Outside University',
          'អានបន្ថែម': 'Read more',

          // Contact
          'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ':
              'Access the University Telegram Channel',
          'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។':
              'Wat Bo Village, Sangkat Sala Kamroeuk, Siem Reap District, Siem Reap Province, Kingdom of Cambodia (Opposite Angkor High School).',

          // About US
          'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា': 'History and Logo meaning',
          'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ': 'University Structure',
          'សាររបស់សាកលវិទ្យាធិការ': 'President Message',
          'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ': 'Vision Mission and Core Value',
          'ការទទួលស្គាល់': 'Recognition',

          // Change Language
          'ភាសា': 'Language',
          'សូមជ្រើសរើសភាសា': 'Please select the language',
          'ភាសាខ្មែរ': 'KHMER',
          'ភាសាអង់គ្លេស': 'ENGLISH',

          // Notification
          'ព័ត៌មានថ្មីៗ': 'Notification',

          // Account
          'គណនីនិស្សិត': 'Student Account',
          'គណនីអាណាព្យាបាល': 'Guardian Account',
          'គណនីបុគ្គលិក': 'Staff Account',
          'គណនីសាស្ត្រាចារ្យ': 'Lecturer Account',

          // Student Dashboard
          'ព័ត៌មានលម្អិតរបស់និស្សិត': 'Student Detail',
          'កាលវិភាគ': 'Schedule',
          'ដំណើរការសិក្សា': 'Performance',
          'វត្តមាន': 'Attendance',
          'ការបង់ប្រាក់': 'Payment',
          'ប្រវត្តិការងារ': 'Job History',
          'ព័ត៌មានការសិក្សា': 'Study Info',
          'មតិកែលម្អ': 'Feedback',
          'សមិទ្ធិផល': 'Achievements',

          // Student Login
          'គណនីនិសិ្សត': 'Student Account',
          'អត្តលេខនិស្សិត': 'Student ID',
          '\t\tបញ្ចូលអត្តលេខ': '\t\tInput Student ID',
          'សូមបញ្ចូលអត្តលេខ': 'Please Input Student ID',
          'ពាក្យសម្ងាត់': 'Password',
          '\t\tបញ្ចូលពាក្យសម្ងាត់': '\t\tInput Password',
          'សូមបញ្ចូលពាក្យសម្ងាត់': 'Please Input Password',
          'ចូល': 'Log In',
          'អត្តលេខនិស្សិត ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!':
              'Incorrect Student ID or Password. Please Input Again!!!',

          // Student Detail
          'ឆ្នាំ': 'Year',
          'ឆមាស': 'Semester',
          'ជំនាន់': 'Promotion',
          'វគ្គ': 'Stage',
          'ឆ្នាំមូលដ្ឋាន': 'Academic Year',
          'មហាវិទ្យាល័យ': 'Faculty',
          'កម្រិតសិក្សា': 'Education',
          'មុខជំនាញ': 'Major',
          'បន្ទប់សិក្សា': 'Room',
          'វេនសិក្សា': 'Shift',
          'ស្ថានភាពសិក្សា': 'Study Status',
          'ថ្ងៃកំណើត': 'Date of birth',
          'លេខទូរស័ព្ទ': 'Phone Number',
          'មុខតំណែង': 'Position',
          'ស្ថាប័ន': 'Institutions',

          // Student Log out
          'ចាកចេញ': 'Log out',
          'តើអ្នកប្រាកដថាអ្នកនឹងចាកចេញពីគណនីនិសិ្សតដែរឬទេ?':
              'Are you sure you want to log out student account?',
          'បោះបង់': 'Cancel',

          // Student Survey
          '\tចំនួនក្រឌីតសរុប': '\tTotal Credits',
          '\tចំនួនក្រឌីតបានបំពេញ': '\tRemaining Credits',
          'សូមជួយវាយដម្លៃការបង្រៀនរបស់សាស្ត្រាចារ្យ':
              'Please evaluate the lecture of the professor',
          'សូមជួយធ្វើការវាយតម្លៃ': 'Please help evaluate',
          'ការវាយតម្លៃ': 'Evaluation',
          'សូមជ្រើសរើសប្រភេទនៃការវាយតម្លៃ!!!':
              'Please select number of survey!!!',
          'ការវាយតម្លៃទី 1': 'Survey 1',
          'ការវាយតម្លៃទី 2': 'Survey 2',

          // Student Schedule
          'កាលវិភាគសិក្សា': 'Schedule',

          // Student Performance
          'មធ្យមភាគៈ': 'Average:',
          'ចំណាត់ថ្នាក់ប្រចាំថ្នាក់ៈ': 'Classification:',
          'ពិន្ទុ': 'Score',
          'លំហាត់': 'Exercises',
          'កិច្ចការផ្ទះ': 'Homework',
          'កិច្ចការក្រុម': 'Assignment',
          'ពាក់កណ្ដាលឆមាស': 'Mid-term',

          // Student Attendance
          'វត្តមាន\t': 'Present',
          'យឺត': 'Late',
          'អវត្តមានមានច្បាប់': 'AWOP',
          'អវត្តមាន': 'Absent',
          '\tក្រេឌីត\t': '\tCredits\t',
          '\tម៉ោង': '\tHours',
          'មើលទាំងអស់': 'Read all',
          'ឆ្នាំទី​ ១': 'Year I',
          'ឆ្នាំទី​ ២': 'Year II',
          'ឆ្នាំទី​ ៣': 'Year III',
          'ឆ្នាំទី​ ៤': 'Year IV',
          'ឆមាសទី ១': 'Semester I',
          'ឆមាសទី ២': 'Semester II',
          'ឆមាសទី 1': 'Semester I',
          'ឆមាសទី 2': 'Semester II',
          'Year I': 'Year I',
          'Year II': 'Year II',
          'Year III': 'Year III',
          'Year IV': 'Year IV',
          'Semester I': 'Semester I',
          'Semester II': 'Semester II',
          'កាលបរិច្ឆេទ': 'Date',

          // Student Payment
          'ឆ្នាំទី​ ': 'Year ',
          'ការបង់ថ្លៃឈ្នួលសិក្សា': 'Tuition payment',
          'ការបង់ថ្លៃឈ្នួលប្រឡងឡើងវិញ': 'Re-examination fee payment',
          'ការបង់ថ្លៃឈ្នួលរៀនបំពេញក្រេឌីត':
              'Tuition fee to complete the credit',
          'ការបង់ថ្លៃឈ្នួលដកលិខិតបញ្ជាក់ការសិក្សាផ្សេងៗ':
              'Fees, withdrawals, certificates of study',
          'ទឹកប្រាក់ត្រូវបង់': 'Money To pay',
          'ទឹកប្រាក់បានបង់': 'Money Paid',
          'ទឹកប្រាក់នៅសល់': 'Money Remain',
          'លេខវិក័យបត្រ': 'Invoice Number',

          // Student Job History
          'កាលបរិច្ឆេទចូលបម្រើការងារ​\t\t\t\t\t': 'Date of entry\t\t\t\t\t',
          'ស្ថានភាពការងារ': 'Job Status',
          'ប្រាក់បៀវត្ស': 'Salary',

          // Student Study Info
          'មុខវិជ្ជា\t': 'Subject\t',
          'បន្ទប់\t': 'Room\t',
          'ម៉ោង\t': 'Time\t',
          'លេខតុ\t': 'Seat\t',

          // Student Feedback
          'សូមអធ្យាស្រ័យ': 'Apologies for any trouble',
          'សូមអធ្យាស្រ័យលោកអ្នកមិនទាន់អាចធ្វើការ Feedback បាននៅឡើយទេ!!!':
              'Sorry, you have not been able to provide feedback yet !!!',
        },
      };
}
