import 'package:get/get.dart';

class LocaleString extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'km_KH': {
          // Guest Dashboard
          'ព្រឹត្តិការណ៍': 'ព្រឹត្តិការណ៍',
          'ការចុះឈ្មោះ': 'ការចុះឈ្មោះ',
          'កម្មវិធីសិក្សា': 'កម្មវិធីសិក្សា',
          'អាហារូបករណ៍': 'អាហារូបករណ៍',
          'ព័ត៌មានការងារ': 'ព៍ត៌មានការងារ',
          'វីដេអូ': 'វីដេអូ',
          'ទំនាក់ទំនង': 'ទំនាក់ទំនង',
          'អំពីយើង': 'អំពីយើង',
          'ផ្លាស់ប្ដូរភាសា': 'ផ្លាស់ប្ដូរភាសា',
          'FAQ': 'FAQ',
          'ទំព័រដើម': 'ទំព័រដើម',
          'ចូលគណនី': 'ចូលគណនី',

          // News Event
          'ព្រឹត្តិការណ៍នាពេលខាងមុខ': 'ព្រឹត្តិការណ៍នាពេលខាងមុខ',
          'ព្រឹត្តិការណ៍មុនៗ': 'ព្រឹត្តិការណ៍មុនៗ',

          // Program
          '\t\tស្វែងរក': '\t\tស្វែងរក',
          'ថ្នាក់បរិញ្ញាបត្ររង': 'ថ្នាក់បរិញ្ញាបត្ររង',
          'ថ្នាក់បរិញ្ញាបត្រ': 'ថ្នាក់បរិញ្ញាបត្រ',
          'ឆ្នាំទី១': 'ឆ្នាំទី១',
          'ឆ្នាំទី២': 'ឆ្នាំទី២',
          'ឆ្នាំទី៣': 'ឆ្នាំទី៣',
          'ឆ្នាំទី៤': 'ឆ្នាំទី៤',
          'ឆមាសទី១': 'ឆមាសទី១',
          'ឆមាសទី២': 'ឆមាសទី២',
          'មុខវិជ្ជា': 'មុខវិជ្ជា',
          'ម៉ោង': 'ម៉ោង',
          'ក្រេឌីត': 'ក្រេឌីត',
          'សរុប': 'សរុប',

          // Scholarship
          'ក្នុងសាកលវិទ្យាល័យ': 'ក្នុងសាកលវិទ្យាល័យ',
          'ក្រៅសាកលវិទ្យាល័យ': 'ក្រៅសាកលវិទ្យាល័យ',
          'អានបន្ថែម': 'អានបន្ថែម',

          // Contact
          'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ':
              'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ',
          'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។':
              'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។',

          // About US
          'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា':
              'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា',
          'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ': 'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ',
          'សាររបស់សាកលវិទ្យាធិការ': 'សាររបស់សាកលវិទ្យាធិការ',
          'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ': 'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ',
          'ការទទួលស្គាល់': 'ការទទួលស្គាល់',

          //Change Language
          'ភាសា': 'ភាសា',
          'សូមជ្រើសរើសភាសា': 'សូមជ្រើសរើសភាសា',
          'ភាសាខ្មែរ': 'ភាសាខ្មែរ',
          'ភាសាអង់គ្លេស': 'ភាសាអង់គ្លេស',
        },
        'en_US': {
          // Guest Dashboard
          'ព្រឹត្តិការណ៍': 'Events',
          'ការចុះឈ្មោះ': 'Registration',
          'កម្មវិធីសិក្សា': 'Program',
          'អាហារូបករណ៍': 'Scholarship',
          'ព័ត៌មានការងារ': 'Career',
          'វីដេអូ': 'Video',
          'ទំនាក់ទំនង': 'Contact',
          'អំពីយើង': 'About US',
          'ផ្លាស់ប្ដូរភាសា': 'Change Language',
          'FAQ': 'FAQ',
          'ទំព័រដើម': 'Home',
          'ចូលគណនី': 'Account',

          // News Event
          'ព្រឹត្តិការណ៍នាពេលខាងមុខ': 'Upcoming Events',
          'ព្រឹត្តិការណ៍មុនៗ': 'Past Events',

          // Program
          '\t\tស្វែងរក': '\t\tSearch',
          'ថ្នាក់បរិញ្ញាបត្ររង': 'Associate Degree',
          'ថ្នាក់បរិញ្ញាបត្រ': 'Bachelor Degree',
          'ឆ្នាំទី១': 'Year 1',
          'ឆ្នាំទី២': 'Year 2',
          'ឆ្នាំទី៣': 'Year 3',
          'ឆ្នាំទី៤': 'Year 4',
          'ឆមាសទី១': 'Semester 1',
          'ឆមាសទី២': 'Semester 2',
          'មុខវិជ្ជា': 'Subject',
          'ម៉ោង': 'Hours',
          'ក្រេឌីត': 'Credits',
          'សរុប': 'Total',

          // Scholarship
          'ក្នុងសាកលវិទ្យាល័យ': 'Inside University',
          'ក្រៅសាកលវិទ្យាល័យ': 'Outside University',
          'អានបន្ថែម': 'Read more',

          // Contact
          'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ':
              'Access the University Telegram Channel',
          'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។':
              'Wat Bo Village, Sangkat Sala Kamroeuk, Siem Reap District, Siem Reap Province, Kingdom of Cambodia (Opposite Angkor High School).',

          // About US
          'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា': 'History and Logo meaning',
          'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ': 'University Structure',
          'សាររបស់សាកលវិទ្យាធិការ': 'President Message',
          'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ': 'Vision Mission and Core Value',
          'ការទទួលស្គាល់': 'Recognition',

          //Change Language
          'ភាសា': 'Language',
          'សូមជ្រើសរើសភាសា': 'Please select the language',
          'ភាសាខ្មែរ': 'KHMER',
          'ភាសាអង់គ្លេស': 'ENGLISH',
        },
      };
}
