import 'package:get/get.dart';

class LocaleString extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'km_KH': {
          // Guest Dashboard
          'ព្រឹត្តិការណ៍': 'ព្រឹត្តិការណ៍',
          'ការចុះឈ្មោះ': 'ការចុះឈ្មោះ',
          'កម្មវិធីសិក្សា': 'កម្មវិធីសិក្សា',
          'អាហារូបករណ៍': 'អាហារូបករណ៍',
          'ព័ត៌មានការងារ': 'ព័ត៌មានការងារ',
          'វីដេអូ': 'វីដេអូ',
          'ទំនាក់ទំនង': 'ទំនាក់ទំនង',
          'អំពីយើង': 'អំពីយើង',
          'ផ្លាស់ប្ដូរភាសា': 'ផ្លាស់ប្ដូរភាសា',
          'FAQ': 'FAQ',
          'ទំព័រដើម': 'ទំព័រដើម',
          'ចូលគណនី': 'ចូលគណនី',

          // News Event
          'ព្រឹត្តិការណ៍នាពេលខាងមុខ': 'ព្រឹត្តិការណ៍នាពេលខាងមុខ',
          'ព្រឹត្តិការណ៍មុនៗ': 'ព្រឹត្តិការណ៍មុនៗ',

          // Program
          'មហាវិទ្យាល័យសេដ្ឋកិច្ច ពាណិជ្ជកម្ម និងទេសចរណ៍':
              'មហាវិទ្យាល័យសេដ្ឋកិច្ច ពាណិជ្ជកម្ម និងទេសចរណ៍',
          'មហាវិទ្យាល័យវិទ្យាសាស្ត្រ និងបច្ចេកវិទ្យា':
              'មហាវិទ្យាល័យវិទ្យាសាស្ត្រ និងបច្ចេកវិទ្យា',
          'មហាវិទ្យាល័យវិទ្យាសាស្ត្រសង្គម និងនីតិសាស្ត្រ':
              'មហាវិទ្យាល័យវិទ្យាសាស្ត្រសង្គម និងនីតិសាស្ត្រ',
          'មហាវិទ្យាល័យសិល្បៈ មនុស្សសាស្ត្រ និងអប់រំ':
              'មហាវិទ្យាល័យសិល្បៈ មនុស្សសាស្ត្រ និងអប់រំ',
          'មហាវិទ្យាល័យអន្តរជាតិ': 'មហាវិទ្យាល័យអន្តរជាតិ',
          'វិទ្យាស្ថានភាសាបរទេស': 'វិទ្យាស្ថានភាសាបរទេស',
          'សាលាថ្នាក់ក្រោយបរិញ្ញាបត្រ': 'សាលាថ្នាក់ក្រោយបរិញ្ញាបត្រ',
          'ម៉ាឃីតធីង': 'ម៉ាឃីតធីង',
          'គ្រប់គ្រង': 'គ្រប់គ្រង',
          'ស្ថាបត្យកម្ម': 'ស្ថាបត្យកម្ម',
          'ព័ត៌មានវិទ្យា': 'ព័ត៌មានវិទ្យា',
          'វិស្វកម្មសំណង់សុីវិល': 'វិស្វកម្មសំណង់សុីវិល',
          'នីតិសាស្ត្រ': 'នីតិសាស្ត្រ',
          'រដ្ឋបាលសាធារណៈ': 'រដ្ឋបាលសាធារណៈ',
          'អក្សរសាស្ត្រខ្មែរ': 'អក្សរសាស្ត្រខ្មែរ',
          'ប្រវិត្តវិទ្យា': 'ប្រវិត្តវិទ្យា',
          'បង្រៀនភាសាអង់គ្លេស': 'បង្រៀនភាសាអង់គ្លេស',
          'បកប្រែភាសាអង់គ្លេស': 'បកប្រែភាសាអង់គ្លេស',
          'ថ្នាក់បរិញ្ញាបត្រជាន់ខ្ពស់': 'ថ្នាក់បរិញ្ញាបត្រជាន់ខ្ពស់',
          'ថ្នាក់បណ្ឌិត': 'ថ្នាក់បណ្ឌិត',
          '\t\tស្វែងរក': '\t\tស្វែងរក',
          'ថ្នាក់បរិញ្ញាបត្ររង': 'ថ្នាក់បរិញ្ញាបត្ររង',
          'ថ្នាក់បរិញ្ញាបត្រ': 'ថ្នាក់បរិញ្ញាបត្រ',
          'ឆ្នាំទី១': 'ឆ្នាំទី១',
          'ឆ្នាំទី២': 'ឆ្នាំទី២',
          'ឆ្នាំទី៣': 'ឆ្នាំទី៣',
          'ឆ្នាំទី៤': 'ឆ្នាំទី៤',
          'ឆមាសទី១': 'ឆមាសទី១',
          'ឆមាសទី២': 'ឆមាសទី២',
          'មុខវិជ្ជា': 'មុខវិជ្ជា',
          'ម៉ោង': 'ម៉ោង',
          'ក្រេឌីត': 'ក្រេឌីត',
          'សរុប': 'សរុប',

          // Scholarship
          'ក្នុងសាកលវិទ្យាល័យ': 'ក្នុងសាកលវិទ្យាល័យ',
          'ក្រៅសាកលវិទ្យាល័យ': 'ក្រៅសាកលវិទ្យាល័យ',
          'អានបន្ថែម': 'អានបន្ថែម',

          // Contact
          'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ':
              'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ',
          'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។':
              'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។',

          // About US
          'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា':
              'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា',
          'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ': 'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ',
          'សាររបស់សាកលវិទ្យាធិការ': 'សាររបស់សាកលវិទ្យាធិការ',
          'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ': 'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ',
          'ការទទួលស្គាល់': 'ការទទួលស្គាល់',

          // Change Language
          'ភាសា': 'ភាសា',
          'សូមជ្រើសរើសភាសា': 'សូមជ្រើសរើសភាសា',
          'ភាសាខ្មែរ': 'ភាសាខ្មែរ',
          'ភាសាអង់គ្លេស': 'ភាសាអង់គ្លេស',

          // Account
          'គណនីនិស្សិត': 'គណនីនិស្សិត',
          'គណនីអាណាព្យាបាល': 'គណនីអាណាព្យាបាល',
          'គណនីបុគ្គលិក': 'គណនីបុគ្គលិក',
          'គណនីសាស្ត្រាចារ្យ': 'គណនីសាស្ត្រាចារ្យ',

          // Student Dashboard
          'ព័ត៌មានលម្អិតរបស់និស្សិត': 'ព័ត៌មានលម្អិតរបស់និស្សិត',
          'កាលវិភាគ': 'កាលវិភាគ',
          'ដំណើរការសិក្សា': 'ដំណើរការសិក្សា',
          'វត្តមាន': 'វត្តមាន',
          'ការបង់ប្រាក់': 'ការបង់ប្រាក់',
          'ប្រវត្តិការងារ': 'ប្រវត្តិការងារ',
          'ព័ត៍មានការសិក្សា': 'ព័ត៍មានការសិក្សា',
          'មតិកែលម្អ': 'មតិកែលម្អ',
          'សម្មិទ្ធផល': 'សម្មិទ្ធផល',

          // Student Login
          'គណនីនិសិ្សត': 'គណនីនិសិ្សត',
          'អត្តលេខនិស្សិត': 'អត្តលេខនិស្សិត',
          '\t\tបញ្ចូលអត្តលេខ': '\t\tបញ្ចូលអត្តលេខ',
          'សូមបញ្ចូលអត្តលេខ': 'សូមបញ្ចូលអត្តលេខ',
          'ពាក្យសម្ងាត់': 'ពាក្យសម្ងាត់',
          '\t\tបញ្ចូលពាក្យសម្ងាត់': '\t\tបញ្ចូលពាក្យសម្ងាត់',
          'សូមបញ្ចូលពាក្យសម្ងាត់': 'សូមបញ្ចូលពាក្យសម្ងាត់',
          'ចូល': 'ចូល',
          'អត្តលេខនិស្សិត ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!':
              'អត្តលេខនិស្សិត ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!',
        },
        'en_US': {
          // Guest Dashboard
          'ព្រឹត្តិការណ៍': 'Events',
          'ការចុះឈ្មោះ': 'Registration',
          'កម្មវិធីសិក្សា': 'Program',
          'អាហារូបករណ៍': 'Scholarship',
          'ព័ត៌មានការងារ': 'Career',
          'វីដេអូ': 'Video',
          'ទំនាក់ទំនង': 'Contact',
          'អំពីយើង': 'About US',
          'ផ្លាស់ប្ដូរភាសា': 'Change Language',
          'FAQ': 'FAQ',
          'ទំព័រដើម': 'Home',
          'ចូលគណនី': 'Account',

          // News Event
          'ព្រឹត្តិការណ៍នាពេលខាងមុខ': 'Upcoming Events',
          'ព្រឹត្តិការណ៍មុនៗ': 'Past Events',

          // Program
          'មហាវិទ្យាល័យសេដ្ឋកិច្ច ពាណិជ្ជកម្ម និងទេសចរណ៍':
              'Faculty of Economics, Business and Tourisms',
          'មហាវិទ្យាល័យវិទ្យាសាស្ត្រ និងបច្ចេកវិទ្យា':
              'Faculty of Science and Technology',
          'មហាវិទ្យាល័យវិទ្យាសាស្ត្រសង្គម និងនីតិសាស្ត្រ':
              'Faculty of Social Science and Law',
          'មហាវិទ្យាល័យសិល្បៈ មនុស្សសាស្ត្រ និងអប់រំ':
              'Faculty of Arts, Humanities and Education',
          'មហាវិទ្យាល័យអន្តរជាតិ': 'International College',
          'វិទ្យាស្ថានភាសាបរទេស': 'Foreign Language Institute',
          'សាលាថ្នាក់ក្រោយបរិញ្ញាបត្រ': 'Post Graduate',
          'ម៉ាឃីតធីង': 'Marketing',
          'គ្រប់គ្រង': 'Management',
          'ស្ថាបត្យកម្ម': 'Engineer',
          'ព័ត៌មានវិទ្យា': 'Information Technology',
          'វិស្វកម្មសំណង់សុីវិល': 'Civil Engineering',
          'នីតិសាស្ត្រ': 'Jurisprudence',
          'រដ្ឋបាលសាធារណៈ': 'Public Administration',
          'អក្សរសាស្ត្រខ្មែរ': 'Khmer Literature',
          'ប្រវិត្តវិទ្យា': 'History',
          'បង្រៀនភាសាអង់គ្លេស': 'Teaching English Language',
          'បកប្រែភាសាអង់គ្លេស': 'Translating English Language',
          'ថ្នាក់បរិញ្ញាបត្រជាន់ខ្ពស់': 'Master Degree',
          'ថ្នាក់បណ្ឌិត': 'Doctoral Degree',
          '\t\tស្វែងរក': '\t\tSearch',
          'ថ្នាក់បរិញ្ញាបត្ររង': 'Associate Degree',
          'ថ្នាក់បរិញ្ញាបត្រ': 'Bachelor Degree',
          'ឆ្នាំទី១': 'Year 1',
          'ឆ្នាំទី២': 'Year 2',
          'ឆ្នាំទី៣': 'Year 3',
          'ឆ្នាំទី៤': 'Year 4',
          'ឆមាសទី១': 'Semester 1',
          'ឆមាសទី២': 'Semester 2',
          'មុខវិជ្ជា': 'Subject',
          'ម៉ោង': 'Hours',
          'ក្រេឌីត': 'Credits',
          'សរុប': 'Total',

          // Scholarship
          'ក្នុងសាកលវិទ្យាល័យ': 'Inside University',
          'ក្រៅសាកលវិទ្យាល័យ': 'Outside University',
          'អានបន្ថែម': 'Read more',

          // Contact
          'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ':
              'Access the University Telegram Channel',
          'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។':
              'Wat Bo Village, Sangkat Sala Kamroeuk, Siem Reap District, Siem Reap Province, Kingdom of Cambodia (Opposite Angkor High School).',

          // About US
          'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា': 'History and Logo meaning',
          'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ': 'University Structure',
          'សាររបស់សាកលវិទ្យាធិការ': 'President Message',
          'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ': 'Vision Mission and Core Value',
          'ការទទួលស្គាល់': 'Recognition',

          // Change Language
          'ភាសា': 'Language',
          'សូមជ្រើសរើសភាសា': 'Please select the language',
          'ភាសាខ្មែរ': 'KHMER',
          'ភាសាអង់គ្លេស': 'ENGLISH',

          // Account
          'គណនីនិស្សិត': 'Student Account',
          'គណនីអាណាព្យាបាល': 'Guardian Account',
          'គណនីបុគ្គលិក': 'Staff Account',
          'គណនីសាស្ត្រាចារ្យ': 'Lecturer Account',

          // Student Dashboard
          'ព័ត៌មានលម្អិតរបស់និស្សិត': 'Student Detail',
          'កាលវិភាគ': 'Schedule',
          'ដំណើរការសិក្សា': 'Performance',
          'វត្តមាន': 'Attendance',
          'ការបង់ប្រាក់': 'Payment',
          'ប្រវត្តិការងារ': 'Job History',
          'ព័ត៌មានការសិក្សា': 'Study Info',
          'មតិកែលម្អ': 'Feedback',
          'សម្មិទ្ធផល': 'Achievements',

          // Student Login
          'គណនីនិសិ្សត': 'Student Account',
          'អត្តលេខនិស្សិត': 'Student ID',
          '\t\tបញ្ចូលអត្តលេខ': '\t\tInput Student ID',
          'សូមបញ្ចូលអត្តលេខ': 'Please Input Student ID',
          'ពាក្យសម្ងាត់': 'Password',
          '\t\tបញ្ចូលពាក្យសម្ងាត់': '\t\tInput Password',
          'សូមបញ្ចូលពាក្យសម្ងាត់': 'Please Input Password',
          'ចូល': 'Log In',
          'អត្តលេខនិស្សិត ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!':
              'Incorrect Student ID or Password. Please Input Again!!!',
        },
      };
}
